//  Задача 35: Задайте одномерный массив из 123 случайных чисел. Найдите количество элементов массива, значения которых лежат в отрезке [10,99]. 
// Пример для массива из 5, а не 123 элементов. В своём решении сделайте для 123
// [5, 18, 123, 6, 2] -> 1
// [1, 2, 3, 6, 2] -> 0
// [10, 11, 12, 13, 14] -> 5

int[] CreateRandomArray(int N, int start, int end)
{
    int[] RandomArray = new int[N];
    for (int i = 0; i < N; i++)
    {
        RandomArray[i] = new Random().Next(start, end + 1);
    }
    return RandomArray;
}

void ShowArray(int[] array)
{
    for (int i = 0; i < array.Length; i++)
    {
        Console.Write(array[i] + " ");
    }
    Console.WriteLine();
}

void TenToNintyNine(int[] array)
{
    int count = 0;
    for (int i = 0; i < array.Length; i++)
    {
        if (array[i] > 10 && array[i] < 99) {count = count + 1;}
       
    }
    Console.WriteLine($"КОЛЛИЧЕСТВО ЭЛЕМЕНТОВ ЗНАЧЕНИЕМ ОТ 10 И ДО 99 = {count}");
}

Console.Clear();
int[] Array1 = CreateRandomArray(123, 1, 1000);
ShowArray(Array1);
TenToNintyNine(Array1);